{
  "layout": {
    "home": "Home",
    "projects": "Projects",
    "experience": "Experience",
    "contact": "Contact"
  },
  "home": {
    "name": "Honoka Noguchi",
    "engineer": "Software Engineer"
  },
  "about-me": {
    "introduction": "Hi, I’m Honoka, a frontend engineer with a background in sales and business development. My passion for solving problems and creating impactful digital experiences led me to transition into software development. I thrive on building intuitive, user-friendly applications that make a difference. Explore my projects, skills, and professional journey!",
    "technologies": "Technologies:",
    "technologies-list": "TypeScript | React | Vue.js | Node.js | Python | PostgreSQL | HTML | CSS",
    "languages": "Languages: ",
    "language-level": "English: Business level, Japanese: Native"
  },
  "project-details": {
    "techstack": "Tech Stack:"
  },
  "projects": {
    "mugi": {
      "name": "Mugi : A bilingual pet sitting platform",
      "description": "I collaborated with three team members on Mugi, a bilingual platform connecting pet owners with trusted sitters. My primary focus was on the frontend, where I led efforts to design and implement scalable and user-friendly interfaces. I also contributed to enhancing accessibility by implementing localization features.",
      "whatIDid": [
        "Designed UI prototypes in Figma to refine user flows and improve usability.",
        "Built responsive, user-focused interfaces with React and TypeScript, integrating seamlessly with backend APIs.",
        "Implemented bilingual (Japanese/English) localization using i18next, expanding accessibility."
      ],
      "techStack": "TypeScript, React, Tailwind CSS, Figma, i18next, Python, FastAPI, PostgreSQL, Firebase, Docker, Render"
    },
    "discover-japan": {
      "name": "Discover Japan : Travel app for hidden destinations",
      "description": "This is my solo project. I developed Discover Japan, a travel app designed to promote sustainable tourism by encouraging users to explore hidden gems across Japan. The app offers personalized recommendations based on user preferences, a clickable map where users can post and view pictures, and a visual representation of visit rates for each prefecture to balance tourism flow.",
      "whatIDid": [
        "Built a dynamic query builder and interactive SVG map to visualize tourism density using CSV data.",
        "Integrated OpenAI API for personalized travel recommendations with optimized prompt engineering.",
        "Developed a system allowing users to upload, retrieve, and view images seamlessly, using AWS S3 with presigned URLs."
      ]
    },
    "chat-app": {
      "name": "Real-Time Chat Application with WebSocket",
      "description": "This is a real-time chat application built using FastAPI and WebSockets. It allows users to send and receive messages instantly through persistent WebSocket connections. The app supports multiple users, stores messages in MongoDB, and ensures seamless two-way communication.",
      "whatIDid": [
        "Designed and implemented the WebSocket communication layer using FastAPI, enabling real-time messaging.",
        "Built a responsive chat UI using React and TypeScript for a smooth user experience.",
        "Integrated MongoDB to store chat history and user data for persistent messaging.",
        "Implemented user authentication and session management to ensure security and data consistency."
      ]
    }
  }
}
