{
  "layout": {
    "about-me": "About me",
    "projects": "Projects",
    "experience": "Experience"
  },
  "home": {
    "name": "Honoka Noguchi",
    "engineer": "ソフトウェアエンジニア"
  },
  "about-me": {
    "introduction": "こんにちは、Honokaです！セールスやプロジェクトマネジメントの経験を経て、現在はフロントエンドエンジニアとして活動しています。問題解決や、人々に価値を与えるデジタル体験を作ることへの情熱から、ソフトウェア開発の道に進みました。直感的で使いやすいアプリケーションを構築し、価値を提供することにやりがいを感じています。ぜひ、私のプロジェクトやスキル、これまでの歩みをご覧ください。",
    "technologies": "テクノロジー:",
    "technologies-list": "TypeScript | React | Vue.js | Node.js | Python | PostgreSQL | HTML | CSS",
    "languages": "言語:",
    "language-level": "英語: ビジネスレベル, 日本語: ネイティブ"
  },
  "project-details": {
    "techstack": "開発環境:"
  },
  "projects": {
    "mugi": {
      "name": "Mugi：バイリンガルのペットシッターサービス",
      "description": "Mugiは、ペットオーナーと信頼できるシッターをつなぐバイリンガルのプラットフォームです。私はフロントエンド開発を主に担当し、スケーラブルでユーザーフレンドリーなインターフェースの設計と実装を行いました。また、i18nextを使用して日本語と英語のローカライズを導入し、アクセシビリティを向上させました。",
      "whatIDid": [
        "Figmaを使用してUIプロトタイプを作成し、ユーザーフローと使いやすさを改善。",
        "ReactとTypeScriptを使用して、ユーザー中心のレスポンシブインターフェースを構築。",
        "i18nextを統合し、日英バイリンガル対応を実装。"
      ],
      "techStack": "TypeScript, React, Tailwind CSS, Figma, i18next, Python, FastAPI, PostgreSQL, Firebase, Docker, Render"
    },
    "discover-japan": {
      "name": "Discover Japan : 隠れた名所を探す旅行アプリ",
      "description": "これは私のソロプロジェクトです。Discover Japan は、日本全国の隠れた名所を探索し、持続可能な観光を促進するために開発した旅行アプリです。ユーザーの好みに基づいたパーソナライズされた観光地のおすすめ機能、写真を投稿・閲覧できるクリック可能なマップ、都道府県ごとの訪問率を可視化するデータ分析機能を備えています。",
      "whatIDid": [
        "CSVデータを使用して観光密度を視覚化する動的クエリビルダーとインタラクティブSVGマップを構築。",
        "OpenAI APIを統合し、ユーザーの好みに基づいたパーソナライズされた旅行のおすすめを提供。",
        "AWS S3のプリサインドURLを活用し、画像のアップロード、取得、表示がスムーズに行えるシステムを開発。",
        "ユーザー認証とセッション管理を実装し、セキュリティとデータの整合性を確保。"
      ]
    },
    "chat-app": {
      "name": "WebSocketを使用したリアルタイムチャットアプリ",
      "description": "FastAPIとWebSocketsを使用して構築されたリアルタイムチャットアプリです。ユーザーはWebSocket接続を介してメッセージを即座に送受信できます。アプリは複数ユーザーをサポートし、MongoDBにメッセージを保存し、シームレスな双方向通信を実現します。",
      "whatIDid": [
        "FastAPIを使用してWebSocket通信レイヤーを設計・実装し、リアルタイムメッセージングを可能にしました。",
        "ReactとTypeScriptを活用して、スムーズなユーザーエクスペリエンスを実現するレスポンシブなチャットUIを構築しました。",
        "MongoDBを統合し、チャット履歴やユーザーデータを保存することで、メッセージの永続化を実現しました。"
      ]
    }
  }
}
